In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql postgresql://student:student@127.0.0.1/sparkifydb
# %sql postgresql://postgres:postgres@172.17.0.2/sparkifydb

In [10]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://postgres:***@172.17.0.2/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 6, 2, 13, 3, 796000), 100, 'free', None, None, 248, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (2, datetime.datetime(2018, 11, 6, 2, 17, 12, 796000), 100, 'free', None, None, 248, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (3, datetime.datetime(2018, 11, 6, 3, 14, 8, 796000), 61, 'free', None, None, 252, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (4, datetime.datetime(2018, 11, 6, 4, 56, 11, 796000), 55, 'free', None, None, 250, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (5, datetime.datetime(2018, 11, 6, 4, 56, 38, 796000), 55, 'free', None, None, 250, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [11]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://postgres:***@172.17.0.2/sparkifydb
5 rows affected.

[(100, 'Adler', 'Barrera', 'M', 'free'),
 (61, 'Samuel', 'Gonzalez', 'M', 'free'),
 (55, 'Martin', 'Johnson', 'M', 'free'),
 (37, 'Jordan', 'Hicks', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [12]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://postgres:***@172.17.0.2/sparkifydb
5 rows affected.

[('SOTCKKY12AB018A141', 'Sonnerie lalaleulé hi houuu', 'ARGSAFR1269FB35070', 0, Decimal('29.54404')),
 ('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, Decimal('337.68444')),
 ('SOPEGZN12AB0181B3D', 'Get Your Head Stuck On Your Neck', 'AREDL271187FB40F44', 0, Decimal('45.66159')),
 ('SOBKWDJ12A8C13B2F3', 'Wild Rose (Back 2 Basics Mix)', 'AR36F9J1187FB406F1', 0, Decimal('230.71302')),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', 0, Decimal('338.23302'))]

In [13]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://postgres:***@172.17.0.2/sparkifydb
5 rows affected.

[('ARGSAFR1269FB35070', 'Blingtones', '', Decimal('NaN'), Decimal('NaN')),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', Decimal('NaN'), Decimal('NaN')),
 ('AREDL271187FB40F44', 'Soul Mekanik', '', Decimal('NaN'), Decimal('NaN')),
 ('AR36F9J1187FB406F1', 'Bombay Rockers', 'Denmark', Decimal('56.27609'), Decimal('9.51695')),
 ('ARAGB2O1187FB3A161', 'Pucho & His Latin Soul Brothers', '', Decimal('NaN'), Decimal('NaN'))]

In [14]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@172.17.0.2/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 6, 2, 13, 3, 796000), 2, 6, 45, 11, 2018, 1),
 (datetime.datetime(2018, 11, 6, 2, 17, 12, 796000), 2, 6, 45, 11, 2018, 1),
 (datetime.datetime(2018, 11, 6, 3, 14, 8, 796000), 3, 6, 45, 11, 2018, 1),
 (datetime.datetime(2018, 11, 6, 4, 56, 11, 796000), 4, 6, 45, 11, 2018, 1),
 (datetime.datetime(2018, 11, 6, 4, 56, 38, 796000), 4, 6, 45, 11, 2018, 1)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).